/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   fdf_free.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ksharlen <ksharlen@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/10/31 13:29:47 by ksharlen          #+#    #+#             */
/*   Updated: 2019/10/31 13:33:50 by ksharlen         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fdf.h"

void	fdf_del_map(t_pixel **map)
{
	if (map && *map)
	{
		free(*map);
		*map = NULL;
	}
}

//!создать после того как добавит цвет к бесцветным картам
// void	fdf_del_height_ptr(int **height)
// {
	
// }
